<%@ page contentType="text/html;charset=UTF-8" language="java" %>
<%@ taglib uri="http://java.sun.com/jsp/jstl/core" prefix="c" %>
<html>
<head>
    <title>Title</title>
</head>
<body>
<h4>2018年12月25日 - 开始搭建个人博客</h4>
<h5>测试阶段~\(^o^)/~</h5>
<h5>----------------------------------------------------------------2018年12月27日</h5>
<h5>2018年12月27日16:23:22 - HTML搭建完毕.</h5>
<h5>2018年12月27日19:09:24 - 数据库搭建完毕.</h5>
<h5>2018年12月27日19:30:42 - html->jsp 文件格式转换完毕</h5>
<h5>2018年12月27日22:32:22 - 后台登陆功能完毕</h5>
<h5>----------------------------------------------------------------2018年12月28日</h5>
<h5>2018年12月28日08:33:39 - 后台登陆,MD5算法加密</h5>
<h5>2018年12月28日00:20:39 - 后台登陆,记住密码功能完成</h5>
<h5>2018年12月28日11:27:57 - 碰到乱码问题-  解决ing......   已解决.</h5>
<h5>2018年12月28日17:19:15 - 完成了分类,标签的增删改的一溜够操作.</h5>
<h5>遇到了前后台数据交互,JSON的问题.  前台传来的数据为JSON...未解决,花费了2个小时的时间. 现在时间 2018年12月28日20:52:44</h5>
<h5>!!!完成了前后端分离的数据交互!!!  重要突破  现在时间: 2018年12月28日21:44:13</h5>
<h5>完成了标签,分类的分类查看,展示,添加操作.</h5>
<h5>----------------------------------------------------------------2018年12月29日</h5>
<h5>2018年12月29日09:19:47 - 标签,分类的修改完成</h5>
<h5>2018年12月29日09:59:09 - 标签,分类 删除功能已完成, 但是有bug</h5>
<h5>2018年12月29日10:11:03 - 开始处理文章模块...</h5>
<h5>2018年12月29日11:58:04 - 解决了文章类型CLoB 类型的数据和读取.</h5>
<h5>2018年12月29日14:11:51 - 列表展示文章功能,完成</h5>
<h5>2018年12月29日17:17:57 - 文章列表, 分页功能 完成 - 里程碑~~~~ \(^o^)/~</h5>
<h5>2018年12月29日18:57:36 - 文章列表的,删除和批量删除  nice  完成~</h5>
<h5>2018年12月29日19:43:42 - 解决了之前ajax的无论如何都不走success的bug</h5>
<h5>2018年12月29日21:45:02 - 完成了添加文章,修改文章 处的 标签分类 的回显问题.  同时解决了富文本框取值的问题.</h5>
<h5>----------------------------------------------------------------2018年12月30日</h5>
<h5>2018年12月30日09:19:47 - 开始文章 添加功能</h5>
<h5>2018年12月30日13:00:23 - 早上9点到现在, 一直在解决ajax请求参数在服务器端获取不到数据的问题.</h5>
<h5>2018年12月30日13:02:19 - 开始文章添加的业务: 需要用事务进行处理. 添加文章的时候,关联的关系表也要添加</h5>
<h5>2018年12月30日13:36:02 - 遇到了批量添加的问题.  暂时先放一放,  还有关系表 的事务的处理. 也先放一放</h5>
<h5>2018年12月30日16:50:16 - 开始文章的修改业务.完成  标签的回显,还没做关系表的处理/</h5>
<h5>2018年12月30日17:36:03 - 完成了事务~~!!!  添加文章的同时,完成了关系的添加.  中间遇到一个bug.  使用的不是同一连接对象. 已解决 </h5>
<h5>2018年12月30日19:21:29 - 完成了标签的回显.  但是修改的时候,还不能修改标签,分类 </h5>
<h5>2018年12月30日19:50:50 - 修改文章标签的思路:  根据文章-删光全部标签, 然后添加又选择的. - 已完成~~ 完成了标签的修改.</h5>
<h5>2018年12月30日20:18:05 - 开始图片的上传和下载. 完成</h5>

<h5>----------------------------------------------------------------2018年12月31日</h5>
<h5>2018年12月31日13:34:56 完成了后台的用户管理,管理员用户管理</h5>
<h5>开始开发前端.</h5>
<h5>完成了主页文章数据的回显</h5>
<h5>头疼~ 偷懒了</h5>

<h5>----------------------------------------------------------------2019年1月1日</h5>
<h5>新的一年到来了. 加油 O(∩_∩)O哈哈~</h5>
<h5>2019年1月1日14:13:04  完成了标签,分类的回显,文章总数的计算</h5>
<h5>在回显文章的时候,体验到了VUE的双向绑定的好用之处...</h5>

<h5>----------------------------------------------------------------2019年1月2日</h5>
<h5>JNDI 改变了 数据库连接方式,使用Tomcat托管数据源</h5>

<h5>----------------------------------------------------------------2019年1月3日</h5>
<h5>2019年1月3日15:57:31 - 对博客主页数据展示进行了修改.使用ajax完成分页和初始化展示.</h5>
<h5>开始做分类查询.   !!! 一开始的时候,文章实体类中没有设计他的集合.  这可咋弄- - </h5>

<h5>需要的功能:  根据类型,找文章.   根据文章,展示类型  完成</h5>
<h5>2019年1月3日19:23:52 - 准备做的小功能: 便签,分类的文章数量的统计. \(^o^)/~ </h5>



</body>
</html>
